In [2]:
import numpy as np
from datascience import *

# Group

In [3]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2020 - sky.column('completed'))
          .drop('completed'))
sky.show(3)

In [6]:
#### 1. How many towers are in each city?

In [ ]:
# skip

In [ ]:
#skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [7]:
sky.group('city')

city       | count
Atlanta    | 38
Austin     | 17
Baltimore  | 14
Boston     | 32
Charlotte  | 12
Chicago    | 358
Cincinnati | 13
Cleveland  | 16
Columbus   | 13
Dallas     | 20
... (25 rows omitted)

#### 2. For each city, what’s the tallest building?

In [ ]:
# skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip

In [ ]:
#skip

In [8]:
#skip
sky.group('city', max)

city       | name max                                | material max | height max | age max
Atlanta    | Westin Peachtree Plaza                  | steel        | 311.8      | 123
Austin     | Windsor on the Lake                     | steel        | 208.15     | 83
Baltimore  | The John and Frances Angelos Law Center | steel        | 161.24     | 109
Boston     | Two International Place                 | steel        | 240.79     | 105
Charlotte  | TradeMark                               | steel        | 265.48     | 96
Chicago    | theWit Hotel                            | steel        | 442.14     | 132
Cincinnati | Scripps Center                          | steel        | 202.69     | 107
Cleveland  | Tower at Erieview                       | steel        | 288.65     | 96
Columbus   | William Green Building                  | steel        | 169.3      | 93
Dallas     | W Dallas Victory Hotel & Residences     | steel        | 280.72     | 92
... (25 rows omitted)

#### 3. For each city, what’s the tallest building for each material?
(back to slides after asking this question)

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
#skip

In [ ]:
# skip

In [ ]:
# skip

In [ ]:
# skip

In [13]:
sky.group(['city', 'material'], max)

city      | material        | name max                                | height max | age max
Atlanta   | concrete        | Westin Peachtree Plaza                  | 264.25     | 44
Atlanta   | mixed/composite | Two Alliance Center                     | 311.8      | 33
Atlanta   | steel           | State of Georgia Building               | 169.47     | 123
Austin    | concrete        | Windsor on the Lake                     | 208.15     | 36
Austin    | steel           | University of Texas Tower               | 93.6       | 83
Baltimore | concrete        | The John and Frances Angelos Law Center | 161.24     | 53
Baltimore | steel           | Mercy Medical Center Inpatient Tower    | 155.15     | 109
Boston    | concrete        | Harbor Towers II                        | 121.92     | 49
Boston    | mixed/composite | Ellison Building                        | 139        | 28
Boston    | steel           | Two International Place                 | 240.79     | 105
... (81 rows omitted)

#### 4. For each city, whats the combined hiehgt of all the buildings?

In [ ]:
# skip

In [12]:
#### 4. For each city, whats the combined hiehgt of all the buildings for the different materials?

In [ ]:
# skip

In [5]:
sky.drop('age').group(['city', 'material'], max)

/opt/conda/lib/python3.8/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray.
  values = np.array(tuple(values))

city      | material        | name max                                | height max
Atlanta   | concrete        | Westin Peachtree Plaza                  | 264.25
Atlanta   | mixed/composite | Two Alliance Center                     | 311.8
Atlanta   | steel           | State of Georgia Building               | 169.47
Austin    | concrete        | Windsor on the Lake                     | 208.15
Austin    | steel           | University of Texas Tower               | 93.6
Baltimore | concrete        | The John and Frances Angelos Law Center | 161.24
Baltimore | steel           | Mercy Medical Center Inpatient Tower    | 155.15
Boston    | concrete        | Harbor Towers II                        | 121.92
Boston    | mixed/composite | Ellison Building                        | 139
Boston    | steel           | Two International Place                 | 240.79
... (81 rows omitted)

In [10]:
sky.drop('age').group(['city', 'material'], sum)

city      | material        | name sum | height sum
Atlanta   | concrete        |          | 4016.93
Atlanta   | mixed/composite |          | 916.96
Atlanta   | steel           |          | 786.9
Austin    | concrete        |          | 2043.43
Austin    | steel           |          | 93.6
Baltimore | concrete        |          | 902.66
Baltimore | steel           |          | 665.12
Boston    | concrete        |          | 423.06
Boston    | mixed/composite |          | 243.2
Boston    | steel           |          | 3728.53
... (81 rows omitted)

(back to slides)
# Pivot

In [2]:
sky = Table.read_table('skyscrapers_v2.csv')
sky = (sky.with_column('age', 2020 - sky.column('completed'))
          .drop('completed'))
sky.drop('height', 'age').where('city', are.not_equal_to('New York City')).where('city', are.not_equal_to('Las Vegas')).show(10)

#### 1. In every city, how many towers are there of each material?

In [14]:
sky.pivot('material', 'city')

city       | concrete | mixed/composite | steel
Atlanta    | 27       | 4               | 7
Austin     | 16       | 0               | 1
Baltimore  | 8        | 0               | 6
Boston     | 4        | 2               | 26
Charlotte  | 5        | 3               | 4
Chicago    | 244      | 35              | 79
Cincinnati | 5        | 1               | 7
Cleveland  | 2        | 3               | 11
Columbus   | 4        | 0               | 9
Dallas     | 7        | 2               | 11
... (25 rows omitted)

#### What just happened?
(back to slides)

In [4]:
sky.pivot('material', 'city').show(5)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

In [7]:
sky.pivot('material', 'city').num_rows

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

35

In [9]:
#sky.pivot('city', 'material').show(5)

What happens if you run `group()` with these two columns?

*Remember when grouping on multiple columns, we need to pass in a list of column names*

In [11]:
sky.pivot('material', 'city').show(5)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

In [12]:
sky.group(['material', 'city']).show(5)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

In [13]:
sky.group(['city', 'material']).show(5)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

Let's find the skyscrapers only with steel?

In [18]:
sky.group(['material', 'city']).where('material', are.equal_to('steel')).drop('material')

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

city       | count
Atlanta    | 7
Austin     | 1
Baltimore  | 6
Boston     | 26
Charlotte  | 4
Chicago    | 79
Cincinnati | 7
Cleveland  | 11
Columbus   | 9
Dallas     | 11
... (23 rows omitted)

### Let's find the average height of towers in each city by each material

`tbl.pivot(col1, col2, values, collect)`

In [20]:
sky.pivot('material', 'city')
sky.labels

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

('name', 'material', 'city', 'height', 'age')

In [21]:
sky.pivot('material', 'city', 'height', np.average)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

city       | concrete | mixed/composite | steel
Atlanta    | 148.775  | 229.24          | 112.414
Austin     | 127.714  | 0               | 93.6
Baltimore  | 112.833  | 0               | 110.853
Boston     | 105.765  | 121.6           | 143.405
Charlotte  | 161.348  | 196.01          | 127.013
Chicago    | 128.285  | 160.217         | 130.985
Cincinnati | 102.808  | 202.69          | 120.991
Cleveland  | 116.755  | 166.363         | 136.856
Columbus   | 77.825   | 0               | 120.902
Dallas     | 125.19   | 260.3           | 178.783
... (25 rows omitted)

### Let's find the max height of towers in each city by each material

In [22]:
sky.pivot('material', 'city', 'height', max)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

city       | concrete | mixed/composite | steel
Atlanta    | 264.25   | 311.8           | 169.47
Austin     | 208.15   | 0               | 93.6
Baltimore  | 161.24   | 0               | 155.15
Boston     | 121.92   | 139             | 240.79
Charlotte  | 265.48   | 239.7           | 179.23
Chicago    | 423.22   | 306.94          | 442.14
Cincinnati | 125      | 202.69          | 175
Cleveland  | 125      | 288.65          | 215.8
Columbus   | 79.25    | 0               | 169.3
Dallas     | 176.48   | 280.72          | 270.06
... (25 rows omitted)

In [23]:
def max_min_difference(column):
    """
    Find the difference between the maximum value and minimum value of a column
    """
    return max(column) - min(column)

In [27]:
np.arange(1,100)
max(np.arange(1, 100)) - min(np.arange(1,100)), max_min_difference(np.arange(1,100))

(98, 98)

In [28]:
type(max_min_difference)

function

In [29]:
sky.pivot('material', 'city', 'height', max_min_difference)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

city       | concrete | mixed/composite | steel
Atlanta    | 184.25   | 191.28          | 121.27
Austin     | 127.99   | 0               | 0
Baltimore  | 90.74    | 0               | 71.15
Boston     | 53.34    | 34.8            | 166.39
Charlotte  | 166.42   | 92.18           | 98.23
Chicago    | 378.72   | 255.84          | 388.79
Cincinnati | 38.5     | 0               | 120.7
Cleveland  | 16.49    | 197.21          | 127.71
Columbus   | 3.45     | 0               | 125.41
Dallas     | 122.84   | 40.84           | 156.67
... (25 rows omitted)

In [35]:
atlanta_heights = sky.where('city', 'Atlanta').where('material', 'concrete').column('height')
max(atlanta_heights) - min(atlanta_heights)

184.25

In [37]:
sky.group(['city', 'material']).where('city', 'Austin')

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

city   | material | count
Austin | concrete | 16
Austin | steel    | 1

In [39]:
sky.pivot('city', 'material')

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

material        | Atlanta | Austin | Baltimore | Boston | Charlotte | Chicago | Cincinnati | Cleveland | Columbus | Dallas | Denver | Detroit | Honolulu | Houston | Indianapolis | Jersey City | Kansas City | Las Vegas | Los Angeles | Miami | Miami Beach | Milwaukee | Minneapolis | New York City | Philadelphia | Phoenix | Pittsburgh | Portland | Sacramento | Salt Lake City | San Diego | San Francisco | Seattle | St. Louis | Sunny Isles Beach
concrete        | 27      | 16     | 8         | 4      | 5         | 244     | 5          | 2         | 4        | 7      | 5      | 6       | 47       | 27      | 9            | 14          | 3           | 33        | 9           | 78    | 19          | 9         | 18          | 249           | 14           | 7       | 2          | 4        | 3          | 6              | 11        | 10            | 14      | 6         | 22
mixed/composite | 4       | 0      | 0         | 2      | 3         | 35      | 1          | 3         | 0        | 2      | 2      | 0       | 0        | 7       | 0            | 0           | 0           | 6         | 3           | 4     | 0           | 0         | 9           | 19            | 2            | 4       | 2          | 1        | 1          | 0              | 1         | 3             | 9       | 1         | 0
steel           | 7       | 1      | 6         | 26     | 4         | 79      | 7          | 11        | 9        | 11     | 4      | 14      | 3        | 20      | 7            | 2           | 7           | 5         | 37          | 4     | 0           | 5         | 12          | 263           | 15           | 4       | 32         | 5        | 7          | 7              | 9         | 48            | 31      | 8         | 0

(back to slides)
# Join

In [40]:
billionaires = Table.read_table('billionaires.csv')
billionaires.show(10)

countries = Table.read_table('countries.csv')
countries.show(10)

### What can we join these two tables on?
In other words, which columns will have similar values?

In [ ]:
# answer below

In [42]:
#tblA.join(colA, tblB, colB)
billionaires.join('citizenship', countries, 'Country')

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [44]:
billionaires.num_rows, countries.num_rows, billionaires.join('citizenship', countries, 'Country').num_rows

(500, 198, 500)

In [45]:
countries.join('Country', billionaires, 'citizenship')

Country   | Continent     | name                | net worth   | industry
Australia | Oceania       | Gina Rinehart       | 19984845036 | Commodities
Australia | Oceania       | Andrew Forrest      | 10221458789 | Commodities
Australia | Oceania       | Harry Triguboff     | 9467000000  | Real Estate
Australia | Oceania       | Scott Farquhar      | 9335988154  | Technology
Australia | Oceania       | Mike Cannon-Brookes | 9335988154  | Technology
Australia | Oceania       | Frank Lowy          | 6655432824  | Real Estate
Australia | Oceania       | Anthony Pratt       | 6566000000  | Industrial
Austria   | Europe        | Dietrich Mateschitz | 12251315379 | Food & Beverage
Austria   | Europe        | Johann Graf         | 6509183360  | Entertainment
Brazil    | South America | Jorge Paulo Lemann  | 23056345424 | Food & Beverage
... (490 rows omitted)

##### How many billionaries are in a specific industry and Continent?

In [ ]:
# answer below

In [46]:
b_and_c = billionaires.join('citizenship', countries, 'Country')
b_and_c

citizenship | name                | net worth   | industry        | Continent
Australia   | Gina Rinehart       | 19984845036 | Commodities     | Oceania
Australia   | Andrew Forrest      | 10221458789 | Commodities     | Oceania
Australia   | Harry Triguboff     | 9467000000  | Real Estate     | Oceania
Australia   | Scott Farquhar      | 9335988154  | Technology      | Oceania
Australia   | Mike Cannon-Brookes | 9335988154  | Technology      | Oceania
Australia   | Frank Lowy          | 6655432824  | Real Estate     | Oceania
Australia   | Anthony Pratt       | 6566000000  | Industrial      | Oceania
Austria     | Dietrich Mateschitz | 12251315379 | Food & Beverage | Europe
Austria     | Johann Graf         | 6509183360  | Entertainment   | Europe
Brazil      | Jorge Paulo Lemann  | 23056345424 | Food & Beverage | South America
... (490 rows omitted)

In [48]:
b_and_c.pivot('Continent', 'industry')

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

industry        | Africa | Asia | Europe | North America | Oceania | South America
Commodities     | 0      | 7    | 1      | 6             | 2       | 2
Consumer        | 0      | 10   | 17     | 14            | 0       | 0
Diversified     | 2      | 27   | 13     | 10            | 0       | 0
Energy          | 0      | 12   | 1      | 17            | 0       | 0
Entertainment   | 0      | 4    | 4      | 9             | 0       | 0
Finance         | 0      | 4    | 1      | 29            | 1       | 6
Food & Beverage | 1      | 11   | 9      | 14            | 0       | 4
Health Care     | 0      | 11   | 10     | 6             | 0       | 0
Industrial      | 2      | 21   | 21     | 4             | 1       | 1
Media & Telecom | 2      | 3    | 4      | 19            | 0       | 0
... (4 rows omitted)

In [49]:
b_and_c.group(['Continent', 'industry'])

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

Continent | industry        | count
Africa    | Diversified     | 2
Africa    | Food & Beverage | 1
Africa    | Industrial      | 2
Africa    | Media & Telecom | 2
Asia      | Commodities     | 7
Asia      | Consumer        | 10
Asia      | Diversified     | 27
Asia      | Energy          | 12
Asia      | Entertainment   | 4
Asia      | Finance         | 4
... (46 rows omitted)

##### What is the average net worth of the billionaries in each specific industry and Continent?

In [51]:
b_and_c.labels

('citizenship', 'name', 'net worth', 'industry', 'Continent')

In [52]:
# tbl.pivot(col1, col2, values, collect)
b_and_c.pivot('Continent', 'industry', 'net worth', np.average)

/home/jupyter-apoliak@barnard.ed-b8a88/.local/lib/python3.7/site-packages/datascience/tables.py:920: VisibleDeprecationWarning: Creating an ndarray from ragged nested sequences (which is a list-or-tuple of lists-or-tuples-or ndarrays with different lengths or shapes) is deprecated. If you meant to do this, you must specify 'dtype=object' when creating the ndarray
  values = np.array(tuple(values))

industry        | Africa      | Asia        | Europe      | North America | Oceania     | South America
Commodities     | 0           | 1.03705e+10 | 9.09765e+09 | 6.89452e+09   | 1.51032e+10 | 1.00079e+10
Consumer        | 0           | 8.03002e+09 | 2.10536e+10 | 9.61956e+09   | 0           | 0
Diversified     | 7.29722e+09 | 1.01818e+10 | 8.05679e+09 | 2.51075e+10   | 0           | 0
Energy          | 0           | 1.50254e+10 | 7.09577e+09 | 6.72667e+09   | 0           | 0
Entertainment   | 0           | 7.96645e+09 | 5.39832e+09 | 1.05302e+10   | 0           | 0
Finance         | 0           | 8.79806e+09 | 8.31946e+09 | 8.92508e+09   | 7.07147e+09 | 9.0227e+09
Food & Beverage | 6.15496e+09 | 9.40541e+09 | 1.04686e+10 | 1.27264e+10   | 0           | 1.41998e+10
Health Care     | 0           | 8.79122e+09 | 5.72663e+09 | 1.00891e+10   | 0           | 0
Industrial      | 1.16792e+10 | 9.31591e+09 | 1.01403e+10 | 3.71755e+10   | 6.566e+09   | 5.36317e+09
Media & Telecom | 4.91348e+09 | 7.12921e+09 | 7.5358e+09  | 8.63351e+09   | 0           | 0
... (4 rows omitted)

##### What is the range of net worths of the billionaries in each specific industry and Continent?

In [ ]:
def range(x):
    return ...

# Comparison

In [53]:
x = 2
y = 3
x, y

(2, 3)

In [54]:
x > 1

True

In [55]:
2 > 1

True

In [56]:
x > y

False

In [57]:
y >= 3

True

In [58]:
x == y

False

In [60]:
x != 2

False

In [59]:
2 != 2

False

In [65]:
2 < x < 5

False

In [66]:
-1 * x < -1 * y

False

### Comparing strings

What do we think `"dog" > "cat"` will return?

In [67]:
"dog" > "cat"

True

In [69]:
"zack" > "adam"

True

In [70]:
"cat" < "dog"

True

Why is this the case?

What about strings that start the same?

In [71]:
"dogma" > "dog"

True

### Comparisions to arrays

In [72]:
range_between_one_twenty = np.arange(1, 20)
range_between_one_twenty

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19])

In [73]:
range_between_one_twenty * 2

array([ 2,  4,  6,  8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34,
       36, 38])

In [74]:
range_between_one_twenty > 2

array([False, False,  True,  True,  True,  True,  True,  True,  True,
        True,  True,  True,  True,  True,  True,  True,  True,  True,
        True])

back to slides

### Combining comparisons

In [80]:
a = True
b = False
a, b

(True, False)

In [81]:
a or b

True

In [82]:
not a, not b

(False, True)

In [84]:

#True and (not False)
#True and True
a and not b

True

In [85]:
x, y

(2, 3)

In [86]:
x > 2 or y > 2

True

In [87]:
x > 2 and y > 2

False

In [88]:
not (x > 2 or y > 2)

False

back to slides
### Aggregating Comparisons

In [89]:
range_between_one_twenty

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19])

In [95]:
6 % 2 == 0

True

Lets find the number of values that are even

In [96]:
# Lets first make a function that tells us if a number is even
def is_even(x):
    """ Converts numbers into bool based on whether the number is even or odd
    """
    return x % 2 == 0

Let's test if this function works:

In [97]:
is_even(2), is_even(5), is_even(-4)

(True, False, True)

Now let's apply this function to our array (either make a new table and use `apply` or pass it to our function)

In [101]:
t = Table().with_columns('number', range_between_one_twenty)
t = t.with_columns('is_even', t.apply(is_even, 'number'))
t

number | is_even
1      | False
2      | True
3      | False
4      | True
5      | False
6      | True
7      | False
8      | True
9      | False
10     | True
... (9 rows omitted)

Now how many of these numbers are even?

In [102]:
sum(t.column('is_even'))

9

back to slides

# Control Statements

In [ ]:
def sign(x):
    '''
    Returns "positive", "negative", "zero" depending on the value of x
    Adam: only use if's
    '''
    return_string = ""
    ...
    return return_string

In [ ]:
sign(10), sign(-10), sign(0)

### `if`, `elif`, and `else`

In [ ]:
def sign(x):
    '''
    Returns "positive", "negative", "zero" depending on the value of x
    '''

### `abs()`
Now try implementing the `abs()` function

In [ ]:
help(abs)

In [ ]:
def abs(x):
    ...

# Random Selection

In [ ]:
groups = make_array('treatment', 'control')
groups

Let's randomly assign 1 individual to each group

Let's randomly assign 5 individuals to each group

Let's repeat this

Do we see any differences?

So now let's store the outcome

back to slides
# `np.append()`
Manually grow an empty array to [0,...,8] one element at a time

back to slides
# `For` Statements

In [ ]:
for i in np.arange(4):
    print('iteration', i)

Use a for loop to grow the array `t`

In [ ]:
# Initialize Otter
import otter
grader = otter.Notebook()
grader.export("Lecture_8_completed.ipynb", pdf=False)